FKDD_COPY_DIFF_3_2026-02-14/Reports/БТ_ОтчетПоВизитамЛайт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>БТ_ОтчетПоВизитамЛайт</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/БТ_СписокКонстантныхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БТ_СписокКонстантныхЗначений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответсвенный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Reports/БТ_ОтчетПоВизитамЛайт/Ext/ManagerModule.bsl
Функция ПолучитьСоответсвиеТиповРемонта()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение.Наименование КАК Наименование
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетностьПоВизитам_ПредставлениеТипПозиции""";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Индексы.Добавить("Значение");

	Возврат РезультатЗапроса;

	
КонецФункции

Процедура ВыгрузитьCSV(Знач Таблица, ИмяФайлаCSV, КолВоСтрокПропуска) Экспорт
	
	Если не ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(Таблица, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		Таблица = ПолучитьТаблицуЗначенийИзТабДок(ТабДок);
		
	КонецЕсли;
	
	ТекстовыйФайл = Новый ТекстовыйДокумент; 
	Для инд = 1 по КолВоСтрокПропуска Цикл 
		
		ТекстовыйФайл.ДобавитьСтроку(";;");
		
	КонецЦикла;
	
	СоответсвиеТиповРемонта = ПолучитьСоответсвиеТиповРемонта();
	//Если Ложь Тогда
	//	
	//	СоответсвиеТиповРемонта = Новый ТаблицаЗначений;
	//	
	//КонецЕсли	
	Для каждого ТекСтр из Таблица Цикл
		
		Строка = "";
		
		Для каждого ТекКолонка из Таблица.Колонки Цикл
			
			Значение 		= ТекСтр[ТекКолонка.Имя];  
			ЗначениеПоля 	= Строка(Значение);
			
			Если ТекКолонка.Имя = "Типремонта" Тогда
				
				НСтр = СоответсвиеТиповРемонта.Найти(Значение, "Наименование");
				
				Если НСтр = Неопределено Тогда
					
					ЗначениеПоля = "4";
					
				Иначе
					
					ЗначениеПоля = НСтр.Значение;
					
				КонецЕсли;
				
			КонецЕсли;   
			
			
			
			//Если ТипЗнч(Значение) = Тип("Булево") Тогда
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"БЛ=0; БИ=1"));
			//	
			//ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда         
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"ДЛФ=D"));
			//	
			//ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда         
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"ЧГ=0"));
			//	
			//КонецЕсли;                    
			
			ЗначениеПоля = СтрЗаменить(ЗначениеПоля, Символы.ПС, "");
			ЗначениеПоля = СтрЗаменить(ЗначениеПоля, ";", ",");
			
			Строка = Строка + ?(ПустаяСтрока(Строка), "", ";") + ?(ПустаяСтрока(ЗначениеПоля), "Отсутствует", ЗначениеПоля);
			
		КонецЦикла; 
		
		Если КолВоСтрокПропуска = 2 и Ложь Тогда
			
			Строка = Строка + ";Отсутствует;Отсутствует;Отсутствует";
			
		КонецЕсли;
			
		
		ТекстовыйФайл.ДобавитьСтроку(Строка);
		
	КонецЦикла;  
	
	ТекстовыйФайл.Записать(ИмяФайлаCSV, "windows-1251");
	
КонецПроцедуры     

Функция ПолучитьТаблицуЗначенийИзТабДок(ТабДок)
	
	СоответсвиеКолонок = новый Соответствие;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	ЕстьОшибка = ложь;
	Для _У = 1 по 100 цикл
		
		Колонка 			= СокрЛП(Строка(ТабДок.Область(2,_У).Текст));
		
		Если ПустаяСтрока(Колонка) Тогда
			Продолжить;
		КонецЕсли;
		
		Колонка = СтрЗаменить(Колонка, " ", "");
		КолоНка = СтрЗаменить(Колонка, ".", "");
		КолоНка = СтрЗаменить(Колонка, "(", "");
		КолоНка = СтрЗаменить(Колонка, ")", "");
		КолоНка = СтрЗаменить(Колонка, ",", "");
		КолоНка = СтрЗаменить(Колонка, "-", "");
		ТаблицаДанных.Колонки.Добавить(КолоНка);
		 СоответсвиеКолонок.Вставить(Колонка,_У);
		
	КонецЦикла;     
	
	КолВоПропусков = 5;
	Для _У = 3 по 65535 цикл
		
		Если КолВоПропусков = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПробноеЗначение = СокрЛП(Строка(ТабДок.Область(_У,1).Текст));
		
		Если ПустаяСтрока(ПробноеЗначение) ТОгда
			КолВоПропусков = КолВоПропусков - 1;
			Продолжить;
		КонецЕсли;
		
		НовСтр = ТаблицаДанных.Добавить();
		
		Для каждого ТекСтр из СоответсвиеКолонок Цикл
			
			Значение = СокрЛП(Строка(ТабДок.Область(_У,ТекСтр.Значение).Текст));
			НовСтр[ТекСтр.Ключ] = Значение;
				
		КонецЦикла;

	КонецЦикла;
	
	Возврат ТаблицаДанных
	
КонецФункции
